In [1]:
import re

In [2]:
s = '1234567890'

In [4]:
len(s)

10

In [7]:
ax = re.match(pattern='\d{10}', string = s)

In [8]:
ax

In [9]:
type(ax)

re.Match

In [10]:
bool(ax)

True

In [12]:
ax.group() if bool(ax) else "error"

'1234567890'

In [13]:
ax = False

In [14]:
ax.group() if bool(ax) else "error"

'error'

In [16]:
ax = re.match(pattern='\d{10}', string = s)

In [17]:
s[ax.start()]

'1'

In [19]:
s[ax.end() - 1]

'0'

In [20]:
ax.group()

'1234567890'

In [21]:
ax.start()

0

In [22]:
ax.end()

10

In [23]:
ax.span()

(0, 10)

In [24]:
ax.group()

'1234567890'

In [25]:
s = '123 456 7890'

In [26]:
re.match(pattern='\d{3}\s\d{3}\s\d{4}', string = s)

In [27]:
s = '(123) 456-7890'

In [28]:
re.match(pattern='\(\d{3}\)\s\d{3}\-\d{4}', string = s)

In [29]:
s = '+1 (123) 456-7890'

In [30]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string = s)

In [31]:
p = re.compile('\d{10}')
p.match('1234567890')

In [35]:
my_exp = lambda x : x ** 2

In [36]:
my_exp_c = lambda x, n : x ** n

In [37]:
my_exp(4)

16

In [38]:
my_exp_c(2, 4)

16

In [34]:
def my_exp(x):
    return x ** 2
def my_exp_c(x, n):
    return x ** n

In [39]:
my_exp(4)

16

In [40]:
my_exp_c(2, 4)

16

In [41]:
import pandas as pd

In [42]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [43]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [44]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [45]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [46]:
df['a'].apply(my_exp_c, n = 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [47]:
df['a'].apply(my_exp_c, n = 3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [48]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [49]:
printme = lambda x: print(x)

In [50]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [52]:
df.apply(printme, axis = 0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [53]:
df['a']

0    10
1    20
2    30
Name: a, dtype: int64

In [54]:
df['b']

0    20
1    30
2    40
Name: b, dtype: int64

In [55]:
def mymean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [ ]:
def mymena(x):
    sum = 0
    for i in x:
        sum += i
    return sum / df.shape[0]
# 열 방향 데이터 처리 코드
# 모든 열을 대상으로 할 때는 axis 0, 1 ( 행렬 반전 )

In [56]:
df.apply(mymean)

a    20.0
b    30.0
dtype: float64

In [57]:
df.mean()

a    20.0
b    30.0
dtype: float64

In [58]:
df.apply(mymean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [59]:
import numpy as np

In [60]:
df.apply(np.mean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [61]:
import seaborn as sns

In [62]:
df = sns.load_dataset("titanic")

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [64]:
isnan = lambda x : pd.isnull(x).sum()

In [65]:
df.apply(isnan)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [66]:
isnanp = lambda x : pd.isnull(x).sum() / x.size

In [67]:
df.apply(isnanp)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [76]:
isnanp = lambda x : pd.isnull(x).sum() / len(x)

In [69]:
df.apply(isnanp)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [72]:
def printx(x):
    print(x.size)

In [73]:
df.apply(printx)

891
891
891
891
891
891
891
891
891
891
891
891
891
891
891

survived       None
pclass         None
sex            None
age            None
sibsp          None
parch          None
fare           None
embarked       None
class          None
who            None
adult_male     None
deck           None
embark_town    None
alive          None
alone          None
dtype: object

In [74]:
def printx(x):
    print(len(x))

In [75]:
df.apply(printx)

891
891
891
891
891
891
891
891
891
891
891
891
891
891
891

survived       None
pclass         None
sex            None
age            None
sibsp          None
parch          None
fare           None
embarked       None
class          None
who            None
adult_male     None
deck           None
embark_town    None
alive          None
alone          None
dtype: object

In [81]:
b = df.apply(isnanp)
b

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [78]:
nonnanp = lambda x : 1 - (pd.isnull(x).sum() / x.size)

In [80]:
a = df.apply(nonnanp)
a

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [82]:
a + b

survived       1.0
pclass         1.0
sex            1.0
age            1.0
sibsp          1.0
parch          1.0
fare           1.0
embarked       1.0
class          1.0
who            1.0
adult_male     1.0
deck           1.0
embark_town    1.0
alive          1.0
alone          1.0
dtype: float64

In [90]:
cmis_row = df.apply(lambda x : pd.isnull(x).sum(), axis = 1 )
pmis_row = df.apply(lambda x : (pd.isnull(x).sum() / x.size), axis = 1)
pcom_row = df.apply(lambda x : 1 - ((pd.isnull(x).sum()) / x.size), axis = 1)

In [91]:
df['cmis'] = cmis_row
df['pmis'] = pmis_row
df['pcom'] = pcom_row

In [92]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,cmis,pmis,pcom
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2,0.111111,0.888889
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1,0.055556,0.944444
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2,0.111111,0.888889
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1,0.055556,0.944444
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2,0.111111,0.888889
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2,0.111111,0.888889
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1,0.055556,0.944444
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3,0.166667,0.833333
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1,0.055556,0.944444
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2,0.111111,0.888889

In [93]:
cmis_row

0      2
1      1
2      2
3      1
4      2
      ..
886    2
887    1
888    3
889    1
890    2
Length: 891, dtype: int64

In [94]:
pmis_row

0      0.111111
1      0.055556
2      0.111111
3      0.055556
4      0.111111
         ...
886    0.111111
887    0.055556
888    0.166667
889    0.055556
890    0.111111
Length: 891, dtype: float64

In [95]:
pcom_row

0      0.888889
1      0.944444
2      0.888889
3      0.944444
4      0.888889
         ...
886    0.888889
887    0.944444
888    0.833333
889    0.944444
890    0.888889
Length: 891, dtype: float64

In [96]:
df['missing'] = df.apply(lambda x : pd.isnull(x).sum(), axis = 1)

In [97]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,cmis,pmis,pcom,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2,0.111111,0.888889,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1,0.055556,0.944444,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2,0.111111,0.888889,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1,0.055556,0.944444,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2,0.111111,0.888889,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2,0.111111,0.888889,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1,0.055556,0.944444,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3,0.166667,0.833333,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1,0.055556,0.944444,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2,0.111111,0.888889,1

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 19 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  cmis         891 non-null    int64
 16  pmis         891 non-null    float64
 17  pcom         891 non-null    float64
 18  missing      891 non-null    int64
dtypes: bool(2), category(2), float64(4), int64(6), object(5)
memory usage: 108.5+ KB

In [100]:
df[df['missing'] >= 2].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,cmis,pmis,pcom,missing
573,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,3,0.166667,0.833333,2
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True,3,0.166667,0.833333,2
260,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,3,0.166667,0.833333,2
126,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,3,0.166667,0.833333,2
388,0,3,male,NaN,0,0,7.7292,Q,Third,man,True,NaN,Queenstown,no,True,3,0.166667,0.833333,2
250,0,3,male,NaN,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True,3,0.166667,0.833333,2
466,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True,3,0.166667,0.833333,2
653,1,3,female,NaN,0,0,7.8292,Q,Third,woman,False,NaN,Queenstown,yes,True,3,0.166667,0.833333,2
517,0,3,male,NaN,0,0,24.1500,Q,Third,man,True,NaN,Queenstown,no,True,3,0.166667,0.833333,2
495,0,3,male,NaN,0,0,14.4583,C,Third,man,True,NaN,Cherbourg,no,True,3,0.166667,0.833333,2

In [101]:
df = pd.read_csv('../data/gapminder.tsv', sep = '\t')

In [102]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [103]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [104]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [105]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [106]:
print(df['year'].unique())

[1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 2002 2007]

In [108]:
ax = []
for i in df['year'].unique():
    ax.append(i)

In [109]:
ax

[1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002, 2007]

In [110]:
list(df['year'].unique())

[1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002, 2007]

In [111]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [114]:
df.loc[:,['country','continent']]

          country continent
0     Afghanistan      Asia
1     Afghanistan      Asia
2     Afghanistan      Asia
3     Afghanistan      Asia
4     Afghanistan      Asia
...           ...       ...
1699     Zimbabwe    Africa
1700     Zimbabwe    Africa
1701     Zimbabwe    Africa
1702     Zimbabwe    Africa
1703     Zimbabwe    Africa

[1704 rows x 2 columns]

In [115]:
df.loc[df.year == 1952, :]

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
12               Albania    Europe  1952   55.230   1282697  1601.056136
24               Algeria    Africa  1952   43.077   9279525  2449.008185
36                Angola    Africa  1952   30.015   4232095  3520.610273
48             Argentina  Americas  1952   62.485  17876956  5911.315053
...                  ...       ...   ...      ...       ...          ...
1644             Vietnam      Asia  1952   40.412  26246839   605.066492
1656  West Bank and Gaza      Asia  1952   43.160   1030585  1515.592329
1668         Yemen, Rep.      Asia  1952   32.548   4963829   781.717576
1680              Zambia    Africa  1952   42.038   2672000  1147.388831
1692            Zimbabwe    Africa  1952   48.451   3080907   406.884115

[142 rows x 6 columns]

In [116]:
df[df['year'] == 1952]

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
12               Albania    Europe  1952   55.230   1282697  1601.056136
24               Algeria    Africa  1952   43.077   9279525  2449.008185
36                Angola    Africa  1952   30.015   4232095  3520.610273
48             Argentina  Americas  1952   62.485  17876956  5911.315053
...                  ...       ...   ...      ...       ...          ...
1644             Vietnam      Asia  1952   40.412  26246839   605.066492
1656  West Bank and Gaza      Asia  1952   43.160   1030585  1515.592329
1668         Yemen, Rep.      Asia  1952   32.548   4963829   781.717576
1680              Zambia    Africa  1952   42.038   2672000  1147.388831
1692            Zimbabwe    Africa  1952   48.451   3080907   406.884115

[142 rows x 6 columns]

In [120]:
y1952 = df[df['year'] == 1952]['lifeExp'].mean()
y1957 = df[df['year'] == 1957]['lifeExp'].mean()
y1962 = df[df['year'] == 1962]['lifeExp'].mean()
y2007 = df[df['year'] == 2007]['lifeExp'].mean()

In [118]:
y1952

49.057619718309866

In [121]:
y1957

51.50740112676056

In [122]:
y1962

53.609249014084504

In [123]:
y2007

67.00742253521126

In [124]:
pd.DataFrame({
    'year' : [1952, 1957, 1962, 2007],
    "" : [y1952, y1957, y1962, y2007]
})

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [125]:
data = [1, 8, 2, 8, 2, 5, 12, 19, 42, 51]

In [126]:
data

[1, 8, 2, 8, 2, 5, 12, 19, 42, 51]

In [128]:
data.count

In [129]:
df.count()

country      1704
continent    1704
year         1704
lifeExp      1704
pop          1704
gdpPercap    1704
dtype: int64

In [130]:
df.size

10224

In [131]:
df.mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

year         1.979500e+03
lifeExp      5.947444e+01
pop          2.960121e+07
gdpPercap    7.215327e+03
dtype: float64

In [132]:
df.std()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

year         1.726533e+01
lifeExp      1.291711e+01
pop          1.061579e+08
gdpPercap    9.857455e+03
dtype: float64

In [133]:
df.min()

country      Afghanistan
continent         Africa
year                1952
lifeExp           23.599
pop                60011
gdpPercap     241.165876
dtype: object

In [138]:
np.quantile(a = df, q=0.25)

TypeError: '<' not supported between instances of 'float' and 'str'

In [139]:
max(df)

'year'

In [140]:
df.max()

country         Zimbabwe
continent        Oceania
year                2007
lifeExp           82.603
pop           1318683096
gdpPercap    113523.1329
dtype: object

In [141]:
df['year'].sum()

3373068

In [143]:
df['year'].var()

298.0916030534351

In [144]:
df['year'].sem()

0.4182539740019786

In [145]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [146]:
df.first()

TypeError: NDFrame.first() missing 1 required positional argument: 'offset'

In [147]:
first(df)

NameError: name 'first' is not defined

In [148]:
df.first()

TypeError: NDFrame.first() missing 1 required positional argument: 'offset'

In [149]:
df.last()

TypeError: NDFrame.last() missing 1 required positional argument: 'offset'

In [150]:
'IM Just WInner'

'IM Just WInner'

In [151]:
df.count()

country      1704
continent    1704
year         1704
lifeExp      1704
pop          1704
gdpPercap    1704
dtype: int64

In [152]:
df.size

10224

In [153]:
df.mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

year         1.979500e+03
lifeExp      5.947444e+01
pop          2.960121e+07
gdpPercap    7.215327e+03
dtype: float64

In [154]:
df.std()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

year         1.726533e+01
lifeExp      1.291711e+01
pop          1.061579e+08
gdpPercap    9.857455e+03
dtype: float64

In [155]:
df.min()

country      Afghanistan
continent         Africa
year                1952
lifeExp           23.599
pop                60011
gdpPercap     241.165876
dtype: object

In [156]:
np.quantile(q=0.25)

TypeError: quantile() missing 1 required positional argument: 'a'

In [157]:
np.quantile(q=0.50)

TypeError: quantile() missing 1 required positional argument: 'a'

In [159]:
np.quantile(p=0.75)

TypeError: quantile() got an unexpected keyword argument 'p'

In [160]:
df.max()

country         Zimbabwe
continent        Oceania
year                2007
lifeExp           82.603
pop           1318683096
gdpPercap    113523.1329
dtype: object

In [161]:
df.sum()

country      AfghanistanAfghanistanAfghanistanAfghanistanAf...
continent    AsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAs...
year                                                   3373068
lifeExp                                           101344.44468
pop                                                50440465801
gdpPercap                                      12294917.346386
dtype: object

In [162]:
var(df)

NameError: name 'var' is not defined

In [163]:
df.var

<bound method NDFrame._add_numeric_operations.<locals>.var of           country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]>

In [164]:
df.var

<bound method NDFrame._add_numeric_operations.<locals>.var of           country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]>

In [165]:
df.sem()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\1459226325.py:1: FutureWarning: The default value of numeric_only in DataFrame.sem is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.sem()

year         4.182540e-01
lifeExp      3.129179e-01
pop          2.571683e+06
gdpPercap    2.387976e+02
dtype: float64

In [166]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [167]:
df.first()

TypeError: NDFrame.first() missing 1 required positional argument: 'offset'

In [168]:
df.last()

TypeError: NDFrame.last() missing 1 required positional argument: 'offset'

In [169]:
df.nty

AttributeError: 'DataFrame' object has no attribute 'nty'

In [170]:
df.nth

AttributeError: 'DataFrame' object has no attribute 'nth'

In [171]:
def get_mean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [172]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [173]:
df.groupby('year').lifeExp.agg(get_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [174]:
def mean_diff(x, n):
    sum = 0
    for i in x:
        sum += i
    return (sum / len(x)) - n

In [175]:
df.groupby('year').lifeExp.agg(mean_diff, n = df['lifeExp'].mean())

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [176]:
df.groupby('year').lifeExp.agg([np.count_nonzero, np.mean, np.std])

      count_nonzero       mean        std
year
1952            142  49.057620  12.225956
1957            142  51.507401  12.231286
1962            142  53.609249  12.097245
1967            142  55.678290  11.718858
1972            142  57.647386  11.381953
1977            142  59.570157  11.227229
1982            142  61.533197  10.770618
1987            142  63.212613  10.556285
1992            142  64.160338  11.227380
1997            142  65.014676  11.559439
2002            142  65.694923  12.279823
2007            142  67.007423  12.073021

In [178]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [179]:
df.groupby('year').agg({'lifeExp':'mean','pop':'median','gdpPercap':'median'})

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334740
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371108

In [180]:
def my_zscore(x):
    return (x - x.mean()) / x.std()

In [181]:
zscore = lambda x : (x - x.mean()) / x.std()

In [185]:
a = df.groupby('year')['lifeExp'].transform(my_zscore)

In [186]:
b = df.groupby('year')['lifeExp'].transform(zscore)

In [187]:
a

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [188]:
b

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [190]:
"same" if len(a) == len(b) else "different"

'same'

In [191]:
"same" if len(a) == b.size else "different"

'same'

In [192]:
df.shape

(1704, 6)

In [193]:
a.shape

(1704,)

In [194]:
b.shape

(1704,)

In [195]:
b.reset_index()

      index   lifeExp
0         0 -1.656854
1         1 -1.731249
2         2 -1.786543
3         3 -1.848157
4         4 -1.894173
...     ...       ...
1699   1699 -0.081621
1700   1700 -0.336974
1701   1701 -1.574962
1702   1702 -2.093346
1703   1703 -1.948180

[1704 rows x 2 columns]

In [196]:
import seaborn as sns

In [197]:
import numpy as np

In [198]:
tips10 = sns.load_dataset("tips").sample(10, random_state = 42)

In [199]:
tips10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [200]:
tips10.loc[np.random.permutation(tips10.index)[:4], 'total_bill'] = np.NAN

In [201]:
tips10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6           NaN  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176         NaN  2.00    Male    Yes   Sun  Dinner     2
192         NaN  2.56    Male    Yes  Thur   Lunch     2
124         NaN  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [203]:
df = tips10

In [204]:
df.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [205]:
isnan = lambda x : pd.isnull(x).sum()

In [206]:
df.apply(isnan)

total_bill    4
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [207]:
df.groupby('sex').apply(isnan)

        total_bill  tip  sex  smoker  day  time  size
sex
Male             3    0    0       0    0     0     0
Female           1    0    0       0    0     0     0

In [208]:
def fill_na(x):
    return x.fillna(x.mean())

In [209]:
fill_na2 = lambda x : x.fillna(x.mean())

In [212]:
df.groupby('sex').apply(fill_na)

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\4099847327.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  return x.fillna(x.mean())
C:\Users\starl\AppData\Local\Temp\ipykernel_40592\4099847327.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  return x.fillna(x.mean())
C:\Users\starl\AppData\Local\Temp\ipykernel_40592\4154529827.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df.groupby('sex').apply(fill_na)

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6         21.26  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       21.26  2.00    Male    Yes   Sun  Dinner     2
192       21.26  2.56    Male    Yes  Thur   Lunch     2
124       14.19  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [214]:
df['isnan'] = df.groupby('sex').apply(fill_na)

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\4099847327.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  return x.fillna(x.mean())
C:\Users\starl\AppData\Local\Temp\ipykernel_40592\4099847327.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  return x.fillna(x.mean())
C:\Users\starl\AppData\Local\Temp\ipykernel_40592\4209246371.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df['isnan'] = df.groupby('sex').apply(fill_na)

ValueError: Cannot set a DataFrame with multiple columns to the single column isnan

In [215]:
df['finance'] = df.groupby('sex').lifeExp.transform(lambda x : x.fillna(x.mean()))

AttributeError: 'DataFrameGroupBy' object has no attribute 'lifeExp'

In [216]:
df

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6           NaN  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176         NaN  2.00    Male    Yes   Sun  Dinner     2
192         NaN  2.56    Male    Yes  Thur   Lunch     2
124         NaN  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [219]:
df['fill_total_bill'] = df.groupby('sex').total_bill.transform(lambda x : x.fillna(x.mean()))

In [218]:
df

     total_bill   tip     sex smoker   day    time  size  fill_total_bill
24        19.82  3.18    Male     No   Sat  Dinner     2            19.82
6           NaN  2.00    Male     No   Sun  Dinner     2            21.26
153       24.55  2.00    Male     No   Sun  Dinner     4            24.55
211       25.89  5.16    Male    Yes   Sat  Dinner     4            25.89
198       13.00  2.00  Female    Yes  Thur   Lunch     2            13.00
176         NaN  2.00    Male    Yes   Sun  Dinner     2            21.26
192         NaN  2.56    Male    Yes  Thur   Lunch     2            21.26
124         NaN  2.52  Female     No  Thur   Lunch     2            14.19
9         14.78  3.23    Male     No   Sun  Dinner     2            14.78
101       15.38  3.00  Female    Yes   Fri  Dinner     2            15.38

In [220]:
df = sns.load_dataset("tips")

In [221]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [222]:
df.shape

(244, 7)

In [223]:
df['size'].value_counts()

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

In [224]:
df.groupby('size').filter(lambda x : x['size'].count() >= 30)['size'].value_counts()

2    156
3     38
4     37
Name: size, dtype: int64

In [225]:
df = sns.load_dataset("tips").sample(10, random_state = 42)

In [226]:
df

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [227]:
grouped = df.groupby('sex')

In [228]:
grouped

In [229]:
grouped.groups

{'Male': [24, 6, 153, 211, 176, 192, 9], 'Female': [198, 124, 101]}

In [230]:
grouped.mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\2755795945.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean()

        total_bill       tip      size
sex
Male         20.02  2.875714  2.571429
Female       13.62  2.506667  2.000000

In [231]:
def mean2(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [233]:
grouped.transform(mean2)

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\951041109.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.transform is deprecated. In a future version, a TypeError will be raised. Before calling .transform, select only columns which should be valid for the function.
  grouped.transform(mean2)

     total_bill       tip      size
24        20.02  2.875714  2.571429
6         20.02  2.875714  2.571429
153       20.02  2.875714  2.571429
211       20.02  2.875714  2.571429
198       13.62  2.506667  2.000000
176       20.02  2.875714  2.571429
192       20.02  2.875714  2.571429
124       13.62  2.506667  2.000000
9         20.02  2.875714  2.571429
101       13.62  2.506667  2.000000

In [234]:
df.mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

total_bill    18.100
tip            2.765
size           2.400
dtype: float64

In [235]:
grouped.mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\2755795945.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean()

        total_bill       tip      size
sex
Male         20.02  2.875714  2.571429
Female       13.62  2.506667  2.000000

In [236]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [237]:
grouped.get_group('Female')

     total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [238]:
grouped.get_group('Male')

     total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2

In [239]:
for i in grouped:
    print(i)

('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)
('Female',      total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2)

In [242]:
for i in grouped:
    print(f"the type is {type(i)}")
    print(f"the length is {len(i)}")
    print(f"the name is {i[0]}")

the type is <class 'tuple'>
the length is 2
the name is Male
the type is <class 'tuple'>
the length is 2
the name is Female

In [243]:
df

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [245]:
grp = df.groupby(['sex','time']).mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\493704488.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grp = df.groupby(['sex','time']).mean()

In [246]:
grp

               total_bill       tip      size
sex    time
Male   Lunch    28.440000  2.560000  2.000000
       Dinner   18.616667  2.928333  2.666667
Female Lunch    12.740000  2.260000  2.000000
       Dinner   15.380000  3.000000  2.000000

In [247]:
type(grp)

pandas.core.frame.DataFrame

In [248]:
grp.columns

Index(['total_bill', 'tip', 'size'], dtype='object')

In [249]:
grp.index

MultiIndex([(  'Male',  'Lunch'),
            (  'Male', 'Dinner'),
            ('Female',  'Lunch'),
            ('Female', 'Dinner')],
           names=['sex', 'time'])

In [250]:
df.groupby(['sex','time']).mean().reset_index()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\3801897620.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex','time']).mean().reset_index()

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000

In [252]:
df.groupby(['sex','time'], as_index=False).mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_40592\54886949.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex','time'], as_index=False).mean()

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000

In [253]:
import datetime

In [254]:
now1 = datetime.datetime.now()

In [256]:
print(now1
     )

2023-12-16 16:10:11.236914

In [257]:
now2 = datetime.datetime.today()

In [258]:
print(now2)

2023-12-16 16:10:28.194973

In [259]:
t1 = datetime.datetime.now()
t2 = datetime.datetime(1970, 1, 1)
t3 = datetime.datetime(1970, 12, 12, 13, 24, 34)

In [260]:
for i in [t1, t2, t3]:
    print(i)

2023-12-16 16:11:12.864455
1970-01-01 00:00:00
1970-12-12 13:24:34

In [261]:
diff1 = t1 - t2

In [263]:
print(diff1)

19707 days, 16:11:12.864455

In [265]:
print(type(diff1))

<class 'datetime.timedelta'>

In [266]:
diff2 = t2 - t3

In [267]:
print(diff2)

-346 days, 10:35:26

In [268]:
print(type(diff2))

<class 'datetime.timedelta'>

In [269]:
import pandas as pd

In [270]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=[0])

In [271]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [272]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: datetime64[ns](1), float64(16), int64(1)
memory usage: 17.3 KB

In [273]:
df = pd.read_csv('../data/country_timeseries.csv')

In [274]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,3/27/2014,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,3/26/2014,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,3/25/2014,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,3/24/2014,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,3/22/2014,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [275]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.3+ KB

In [276]:
df['date_dt'] = pd.to_datetime(df['Date'])

In [277]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
 18  date_dt              122 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(16), int64(1), object(1)
memory usage: 18.2+ KB

In [278]:
df = pd.DataFrame({'order day' : ['01/01/15', '02/01/15', '03/01/15']})

In [279]:
df

  order day
0  01/01/15
1  02/01/15
2  03/01/15

In [280]:
df['date_dt1'] = pd.to_datetime(df['order day'], format='%d/%m/%y')
df['date_dt2'] = pd.to_datetime(df['order day'], format='%m/%d/%y')
df['date_dt3'] = pd.to_datetime(df['order day'], format='%y/%m/%d')

In [281]:
df

  order day   date_dt1   date_dt2   date_dt3
0  01/01/15 2015-01-01 2015-01-01 2001-01-15
1  02/01/15 2015-01-02 2015-02-01 2002-01-15
2  03/01/15 2015-01-03 2015-03-01 2003-01-15

In [282]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   order day  3 non-null      object
 1   date_dt1   3 non-null      datetime64[ns]
 2   date_dt2   3 non-null      datetime64[ns]
 3   date_dt3   3 non-null      datetime64[ns]
dtypes: datetime64[ns](3), object(1)
memory usage: 228.0+ bytes

In [283]:
now = datetime.datetime.now()

In [284]:
now

datetime.datetime(2023, 12, 16, 16, 16, 36, 688610)

In [285]:
print(now)

2023-12-16 16:16:36.688610

In [286]:
print(now.strftime('%c'))

Sat Dec 16 16:16:36 2023

In [287]:
print(now.strftime('%x'))

12/16/23

In [288]:
now.strftime('%a')

'Sat'

In [289]:
now.strftime('%A')

'Saturday'

In [290]:
now.strftime('%w')

'6'

In [291]:
now.strftime('%d')

'16'

In [293]:
now.strftime('%b')

'Dec'

In [294]:
now.strftime('%B')

'December'

In [295]:
now.strftime('%m')

'12'

In [297]:
now.strftime('%y')

'23'

In [298]:
now.strftime('%Y')

'2023'

In [299]:
now.strftime('%H')

'16'

In [300]:
now.strftime('%I')

'04'

In [301]:
now.strftime('%p')

'PM'

In [302]:
now.strftime('%M')

'16'

In [303]:
now.strftime('%S')

'36'

In [304]:
now.strftime('%f')

'688610'

In [306]:
now.strftime('%Z')N

''

In [307]:
now.strftime('%j')`

'350'

In [308]:
now.strftime('%U')

'50'

In [309]:
now.strftime('%c')

'Sat Dec 16 16:16:36 2023'

In [310]:
now.strftime('%x')

'12/16/23'

In [312]:
now.strftime('%X')

'16:16:36'